package com.heima.方法概述;
/*
    方法定义的通用格式:
        public static 返回值类型 方法名(参数列表){
            方法体;
            return 值;
        }
        返回值类型,根据需求进行定义
        参数列表:参数可以有一个也可以有多个,如果有多个参数,需要使用','间隔
        方法体:方法的功能
        return: 用来返回方法最终的结果,但是返回值的数据类型要和方法定义时的返回值一致
    注意事项:
        1.方法不能嵌套定义
        2.方法在定义完成后,不会自己执行,需要被调用才能执行
        3.方法名做到见名知义,符合小驼峰的命名规范
        4.如果方法没有返回值,return 语句可以省略不写,如果一定要写,只能return;
 */
public class Demo4方法定义的通用格式 {
    public static void main(String[] args) {

    }
}
